OpenFOAM-v2112/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/0.orig/filmRegion/Uf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      Uf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    coupledWall_top                 // Patch to Region0
    {
        type            slip;
    }

    region0_to_filmRegion_coupledWall // Patch to pyrolysis
    {
        type            noSlip;
    }

    outlet
    {
        type zeroGradient;
    }

    "side.*"
    {
        type            noSlip;
    }

    inlet
    {
        type            fixedValue;
        rho             rhof;
        value           uniform (0 0 -0.01);
    }
}


// ************************************************************************* //
